In [1]:
import numpy as np,pandas as pd

In [2]:
df = pd.DataFrame({'A': ['a', 'b', 'a', 'c', 'a', 'c', 'b', 'c'], 
                       'B': [2, 7, 1, 3, 3, 2, 4, 8], 
                       'C': [100, 87, 96, 130, 105, 87, 96, 155]})

In [3]:
df

   A  B    C
0  a  2  100
1  b  7   87
2  a  1   96
3  c  3  130
4  a  3  105
5  c  2   87
6  b  4   96
7  c  8  155

In [4]:
df.groupby('A').apply(lambda x:x.iloc[1])

   A  B   C
A
a  a  1  96
b  b  4  96
c  c  2  87

In [5]:
df.groupby('A').apply(lambda x:x.sort_values('B'))['C'].keys

<bound method Series.keys of A
a  2     96
   0    100
   4    105
b  6     96
   1     87
c  5     87
   3    130
   7    155
Name: C, dtype: int64>

In [6]:
df.groupby('A').apply(lambda x:x.sort_values('B').apply(lambda x:x.iloc[-1]-x.iloc[-2]))

   B   C
A
a  1   5
b  3  -9
c  5  25

In [7]:
df.groupby('A').apply(lambda x:x.sort_values('B').apply(lambda x:x.iloc[-1]-x.iloc[-2]))['C']

A
a     5
b    -9
c    25
Name: C, dtype: int64

In [8]:
df.groupby('A').apply(lambda x:x.sort_values('B').apply(lambda x:x.iloc[-1]-x.iloc[-2]))['C']

A
a     5
b    -9
c    25
Name: C, dtype: int64

In [9]:
df.groupby('A').apply(lambda x:x.sort_values('B'))

     A  B    C
A
a 2  a  1   96
  0  a  2  100
  4  a  3  105
b 6  b  4   96
  1  b  7   87
c 5  c  2   87
  3  c  3  130
  7  c  8  155

In [10]:
df.groupby('A',as_index=False).apply(lambda x:x.sort_values('B')).groupby('A',as_index=False).apply(lambda x:x.iloc[-1,2]-x.iloc[-2,2])

0     5
1    -9
2    25
dtype: int64

In [11]:
df1 = pd.DataFrame({'A': [1, 1, 2, 2, 2], 'B': [2, 1, 3, 3, 1], 'C':[1, 1, 2, 1, 1]})
df1

   A  B  C
0  1  2  1
1  1  1  1
2  2  3  2
3  2  3  1
4  2  1  1

In [12]:
df1.groupby('A')['B','C'].apply(lambda x:x.sort_values(['B']))

     B  C
A
1 1  1  1
  0  2  1
2 4  1  1
  2  3  2
  3  3  1

In [13]:
df1.groupby('A').apply(lambda x:x.sort_values(['B']))

     A  B  C
A
1 1  1  1  1
  0  1  2  1
2 4  2  1  1
  2  2  3  2
  3  2  3  1

In [14]:
def fun_last_amt2(arr):
    try:
        return arr.iloc[-1]-arr.iloc[-2]
    except:
        return np.nan

In [15]:
df1.groupby('A').apply(lambda x:x.sort_values(['B']))['C']

A
1  1    1
   0    1
2  4    1
   2    2
   3    1
Name: C, dtype: int64

In [16]:
df

   A  B    C
0  a  2  100
1  b  7   87
2  a  1   96
3  c  3  130
4  a  3  105
5  c  2   87
6  b  4   96
7  c  8  155

In [17]:
df.groupby('A').apply(lambda x:x.sort_values('B'))

     A  B    C
A
a 2  a  1   96
  0  a  2  100
  4  a  3  105
b 6  b  4   96
  1  b  7   87
c 5  c  2   87
  3  c  3  130
  7  c  8  155

In [18]:
df.groupby('A').apply(lambda x:x.sort_values('B').apply(lambda x:x.iloc[-1]-x.iloc[-2]))
# df.groupby('A').apply(lambda x:x.sort_values('B')).apply(lambda x:x.iloc[-1]-x.iloc[-2])

   B   C
A
a  1   5
b  3  -9
c  5  25

In [19]:
# fun_last_amt2
df.groupby('A').apply(lambda x:x.sort_values('B').apply(lambda x:fun_last_amt2(x)))

    A    B     C
A
a NaN  1.0   5.0
b NaN  3.0  -9.0
c NaN  5.0  25.0

In [20]:
df.groupby('A').apply(lambda x:x.sort_values('B').apply(lambda x:x.iloc[-2]-x.iloc[-3] 
                                                        if x.shape[0]>=3
                                                        else np.nan))

     B     C
A
a  1.0   4.0
b  NaN   NaN
c  1.0  43.0

In [21]:
df.groupby('A').apply(lambda x:x.sort_values('B').apply(lambda x:x.iloc[-1]-x.iloc[-2] ))

   B   C
A
a  1   5
b  3  -9
c  5  25

In [22]:
df.shape

(8, 3)

In [23]:
df.groupby('A').apply(lambda x:x.sort_values('B'))

     A  B    C
A
a 2  a  1   96
  0  a  2  100
  4  a  3  105
b 6  b  4   96
  1  b  7   87
c 5  c  2   87
  3  c  3  130
  7  c  8  155

In [24]:
df.groupby('A').apply(lambda x:x.sort_values('B').apply(lambda x:x.iloc[-1]-x.iloc[-2]))

   B   C
A
a  1   5
b  3  -9
c  5  25

In [25]:
#fun_last_amt2
df.groupby('A').apply(lambda x:x.sort_values('B').apply(lambda x:fun_last_amt2(x)))['C']

A
a     5.0
b    -9.0
c    25.0
Name: C, dtype: float64

In [26]:
df.groupby('A').apply(lambda x:x.sort_values('B').apply(lambda x:x.iloc[-2]-x.iloc[-3] if x.shape[0]>=3 else np.nan))['C']

A
a     4.0
b     NaN
c    43.0
Name: C, dtype: float64

In [27]:
amt1=df.groupby('A').apply(lambda x:x.sort_values('B').apply(lambda x:x.iloc[-1]-x.iloc[-2]))['C']
amt2=df.groupby('A').apply(lambda x:x.sort_values('B').apply(lambda x:x.iloc[-2]-x.iloc[-3] if x.shape[0]>=3 else np.nan))['C']

In [28]:
amt1

A
a     5
b    -9
c    25
Name: C, dtype: int64

In [29]:
amt2

A
a     4.0
b     NaN
c    43.0
Name: C, dtype: float64

In [30]:
amt1.index

Index(['a', 'b', 'c'], dtype='object', name='A')

In [31]:
amt=pd.DataFrame()
amt['A']=amt1.index
amt['delta1']=amt1.values
amt

   A  delta1
0  a       5
1  b      -9
2  c      25

In [32]:
amt22=pd.DataFrame()
amt22['A']=amt2.index
amt22['delta2']=amt2.values
amt=amt.merge(amt22,how='left',on='A')
amt

   A  delta1  delta2
0  a       5     4.0
1  b      -9     NaN
2  c      25    43.0

In [33]:
df.groupby(by='A').apply(lambda x:x.sort_values(by=['B']).apply(lambda x:x.iloc[-2]-x.iloc[-3] if x.shape[0]>=3 else np.nan))['C']

A
a     4.0
b     NaN
c    43.0
Name: C, dtype: float64

In [34]:
df.groupby(by='A').apply(lambda x:x.sort_values(by='B').apply(lambda x:x.iloc[-1]-x.iloc[-2]))

   B   C
A
a  1   5
b  3  -9
c  5  25

In [35]:
df.groupby(by='A').apply(lambda x:x.sort_values(by='B').apply(lambda x:x.iloc[-3]-x.iloc[-2] if x.shape[0] >=3 else np.nan))

     B     C
A
a -1.0  -4.0
b  NaN   NaN
c -1.0 -43.0

In [36]:
amt33=df.groupby(by='A').apply(lambda x:x.sort_values(by='B').apply(lambda x:x.iloc[-3]-x.iloc[-2] if x.shape[0] >=3 else np.nan))

In [37]:
amt

   A  delta1  delta2
0  a       5     4.0
1  b      -9     NaN
2  c      25    43.0

In [38]:
amt=amt.merge(amt33,how='inner',on='A')
amt

   A  delta1  delta2    B     C
0  a       5     4.0 -1.0  -4.0
1  b      -9     NaN  NaN   NaN
2  c      25    43.0 -1.0 -43.0